examples_3D_Simulations/7_3D_RM6_noPTO_floating/constant/waveInput.txt
waveHeights
1
...
wavePeriods
1
...
wavePhases
1
...
waveAngles
1
...
waveDirs
1
...
